In [148]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from collections import Counter
from itertools import combinations

In [149]:
data = pd.read_csv('movie_bd_v5.csv')
data.sample(5)

,imdb_id,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_average,release_year
1342,tt0329774,87000000,71073932,xXx: State of the Union,Ice Cube|Willem Dafoe|Samuel L. Jackson|Scott ...,Lee Tamahori,Prepare for the next level,"Ice Cube stars as Darius Stone, a thrill-seeki...",101,Action|Crime|Adventure,Original Film|Columbia Pictures Corporation|Re...,4/27/2005,4.8,2005
553,tt0231402,21150000,39438674,Crocodile Dundee in Los Angeles,Paul Hogan|Linda Kozlowski|Jere Burns|Jonathan...,Simon Wincer,He heard there was wildlife in L.A. He didn't ...,After settling in the tiny Australian town of ...,92,Adventure|Comedy,Bungalow Productions|Silver Lion Films|Vision ...,4/12/2001,4.8,2001
1538,tt0452624,32000000,5914908,The Good German,George Clooney|Cate Blanchett|Tobey Maguire|To...,Steven Soderbergh,"If war is Hell, then what comes after?",An American journalist played by George Cloone...,108,War|Crime|Drama|Mystery|Romance,Warner Bros.|Section Eight Productions|Sunset ...,12/8/2006,5.8,2006
231,tt1929263,12000000,101332962,Heaven is for Real,Greg Kinnear|Kelly Reilly|Connor Corum|Thomas ...,Randall Wallace,Unlock the mystery,Heaven is for Real recounts the true story of ...,99,Drama,TriStar Pictures|Screen Gems|Roth Films,4/16/2014,6.1,2014
1499,tt0465142,17000000,7314027,American Dreamz,Hugh Grant|Dennis Quaid|Mandy Moore|Willem Daf...,Paul Weitz,Imagine a country where more people vote for a...,"The new season of ""American Dreamz,"" the wildl...",107,Comedy|Drama|Family,Universal Pictures|Depth of Field,3/4/2006,4.6,2006

In [150]:
data.describe()

             budget       revenue      runtime  vote_average  release_year
count  1.889000e+03  1.889000e+03  1889.000000   1889.000000   1889.000000
mean   5.431083e+07  1.553653e+08   109.658549      6.140762   2007.860773
std    4.858721e+07  2.146698e+08    18.017041      0.764763      4.468841
min    5.000000e+06  2.033165e+06    63.000000      3.300000   2000.000000
25%    2.000000e+07  3.456058e+07    97.000000      5.600000   2004.000000
50%    3.800000e+07  8.361541e+07   107.000000      6.100000   2008.000000
75%    7.200000e+07  1.782626e+08   120.000000      6.600000   2012.000000
max    3.800000e+08  2.781506e+09   214.000000      8.100000   2015.000000

# Предобработка

In [151]:
answers = {} # создадим словарь для ответов

# тут другие ваши предобработки колонок например:

#the time given in the dataset is in string format.
#So we need to change this in datetime format
# ...

In [152]:
data['profit'] = data['revenue'] - data['budget']
data['list_of_actors'] = data['cast'].apply(lambda x: x.split('|'))

# 1. У какого фильма из списка самый большой бюджет?

Использовать варианты ответов в коде решения запрещено.    
Вы думаете и в жизни у вас будут варианты ответов?)

In [153]:
# в словарь вставляем номер вопроса и ваш ответ на него
# Пример: 
answers['1'] = '2. Spider-Man 3 (tt0413300)'
# запишите свой вариант ответа
answers['1'] = '5. Pirates of the Caribbean: On Stranger Tides (tt1298650)'  # + 
# если ответили верно, можете добавить комментарий со значком "+"

In [154]:
# тут пишем ваш код для решения данного вопроса:
data = pd.read_csv("movie_bd_v5.csv")
budgetes =\
 data.groupby(['original_title'])['budget'].max().sort_values(ascending=False)
print(budgetes.head(5))  #сортируем данные по убыванию от максимального бюджета

original_title
Pirates of the Caribbean: On Stranger Tides    380000000
Pirates of the Caribbean: At World's End       300000000
Avengers: Age of Ultron                        280000000
Tangled                                        260000000
John Carter                                    260000000
Name: budget, dtype: int64

ВАРИАНТ 2

In [155]:
# можно добавлять разные варианты решения
data.groupby(['imdb_id', 'original_title'])['budget']\
    .agg(['max'])\
    .sort_values(by='max', ascending=False)\
    .head(5)
#просто более привлекательный внешний вид :)

                                                             max
imdb_id   original_title
tt1298650 Pirates of the Caribbean: On Stranger Tides  380000000
tt0449088 Pirates of the Caribbean: At World's End     300000000
tt2395427 Avengers: Age of Ultron                      280000000
tt0398286 Tangled                                      260000000
tt0401729 John Carter                                  260000000

# 2. Какой из фильмов самый длительный (в минутах)?

In [156]:
# думаю логику работы с этим словарем вы уже поняли, 
# по этому не буду больше его дублировать
answers['2'] = '2. Gods and Generals (tt0279111)'  # +

In [157]:
data.groupby(['imdb_id', 'original_title'])['runtime']\
    .agg(['max'])\
    .sort_values(by='max', ascending=False)\
    .head(5)
#схожий принцип как и в прошлом задании

                                                         max
imdb_id   original_title
tt0279111 Gods and Generals                              214
tt0167260 The Lord of the Rings: The Return of the King  201
tt0462322 Grindhouse                                     191
tt0360717 King Kong                                      187
tt0213149 Pearl Harbor                                   183

# 3. Какой из фильмов самый короткий (в минутах)?

In [158]:
answers['3'] = '3. Winnie the Pooh (tt1449283)'

In [159]:
data.groupby(['imdb_id', 'original_title'])['runtime']\
    .agg(['max'])\
    .sort_values(by='max', ascending=True)\
    .head(5)
#поменяем параметр 'ascending' для отображения по возрастанию

                                max
imdb_id   original_title
tt1449283 Winnie the Pooh        63
tt0280030 Return to Never Land   72
tt0283426 The Jungle Book 2      72
tt0299172 Home on the Range      76
tt0361089 Valiant                76

# 4. Какова средняя длительность фильмов?

In [160]:
answers['4'] = '2. 110'  # +

In [161]:
data.runtime.mean()

109.6585494970884

# 5. Каково медианное значение длительности фильмов?

In [162]:
answers['5'] = '1. 107'  # +

In [163]:
data.runtime.median()

107.0

# 6. Какой самый прибыльный фильм?
#### Внимание! Здесь и далее под «прибылью» или «убытками» понимается разность между сборами и бюджетом фильма. (прибыль = сборы - бюджет) в нашем датасете это будет (profit = revenue - budget)

In [164]:
# лучше код получения столбца profit вынести в Предобработку что в начале
answers['6'] = '5. Avatar (tt0499549)'

In [215]:
data.groupby(['imdb_id', 'original_title'])['profit']\
    .agg(['max'])\
    .sort_values(by='max', ascending=False)\
    .head(5)

                                               max
imdb_id   original_title
tt0499549 Avatar                        2544505847
tt2488496 Star Wars: The Force Awakens  1868178225
tt0369610 Jurassic World                1363528810
tt2820852 Furious 7                     1316249360
tt0848228 The Avengers                  1299557910

# 7. Какой фильм самый убыточный?

In [166]:
answers['7'] = '5. The Lone Ranger (tt1210819)'

In [216]:
data.groupby(['imdb_id', 'original_title'])['profit']\
    .agg(['max'])\
    .sort_values(by='max', ascending=True)\
    .head(5)

                                              max
imdb_id   original_title
tt1210819 The Lone Ranger              -165710090
tt0318974 The Alamo                    -119180039
tt1305591 Mars Needs Moms              -111007242
tt0180052 The Adventures of Pluto Nash  -92896027
tt0424095 Flushed Away                  -84540684

# 8. У скольких фильмов из датасета объем сборов оказался выше бюджета?

In [168]:
answers['8'] = '1. 1478'

In [169]:
revenue1 = data[data.revenue > data.budget]
#считаем с помощью 'len' количество уникальных значений
len(revenue1.index)

1478

# 9. Какой фильм оказался самым кассовым в 2008 году?

In [170]:
answers['9'] = '4. The Dark Knight (tt0468569)'

In [217]:
data1 = data[data.release_year == 2008]
data1.groupby(['imdb_id', 'original_title'])['profit']\
    .agg(['max'])\
    .sort_values(by='max', ascending=False)\
    .head(5)

                                                                    max
imdb_id   original_title
tt0468569 The Dark Knight                                     816921825
tt0367882 Indiana Jones and the Kingdom of the Crystal Skull  601636033
tt0795421 Mamma Mia!                                          557841637
tt0441773 Kung Fu Panda                                       501744560
tt0448157 Hancock                                             474029371

# 10. Самый убыточный фильм за период с 2012 по 2014 г. (включительно)?

In [172]:
answers['10'] = '5. The Lone Ranger (tt1210819)'

In [218]:
# Очень сложная сортировка датафрейма по годам, я знаю :)
data = pd.read_csv("movie_bd_v5.csv")
data['profit'] = data['revenue'] - data['budget']
data2 = data[data.release_year <= 2014]
data3 = data2[data.release_year >= 2012]
data3.groupby(['imdb_id', 'original_title', 'release_date'])['profit']\
    .agg(['max'])\
    .sort_values(by='max', ascending=True)\
    .head(5)

C:\Users\Asus\anaconda3\lib\site-packages\ipykernel_launcher.py:5: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """

                                                              max
imdb_id   original_title                  release_date
tt1210819 The Lone Ranger                 7/3/2013     -165710090
tt0790736 R.I.P.D.                        7/18/2013     -68351500
tt1374992 Upside Down                     9/27/2012     -51893525
tt0884726 Legends of Oz: Dorothy's Return 6/13/2013     -51337973
tt1308729 Bullet to the Head              1/31/2013     -45510171

# 11. Какого жанра фильмов больше всего?

In [174]:
answers['11'] = '3. Drama'

In [175]:
# эту задачу тоже можно решать разными подходами, попробуй реализовать разные варианты
# если будешь добавлять функцию - выноси ее в предобработку что в начале
genres_list = pd.Series(data['genres'].str.cat(sep='|').split('|'))\
    .value_counts(ascending=False).head(5)
genres_list

Drama        782
Comedy       683
Thriller     596
Action       582
Adventure    415
dtype: int64

ВАРИАНТ 2

# 12. Фильмы какого жанра чаще всего становятся прибыльными?

In [176]:
answers['12'] = '1. Drama'

In [177]:
# Создаем новый датафрейм отсортированный по прибыли
most_profit = data[data['profit'] > 0]
# Превращаем все в список с разделением по '|'
genres_list_1 = pd.Series(most_profit['genres'].str.cat(sep='|').split('|'))\
    .value_counts(ascending=False).head(5)
#Выводим отсортированный по убыванию список
genres_list_1

Drama        560
Comedy       551
Thriller     446
Action       444
Adventure    337
dtype: int64

# 13. У какого режиссера самые большие суммарные кассовые сбооры?

In [178]:
answers['13'] = '5. Peter Jackson'

In [179]:
  # Превращаем все в одну строку и разделяем по '|'
directors = pd.Series(data['director'].str.cat(sep='|').split('|'))\
    .value_counts(ascending=False)
  # Проходим по значениям directors в цикле
for i in directors.index:
  # Присваем значение каждой из строк(это и есть сумма выручки)
    directors[i] = data['revenue'][data['director']\
 .map(lambda x: True if i in x else False)].sum()
directors.sort_values(ascending=False).head(5)

Peter Jackson        6490593685
Christopher Nolan    4167548502
David Yates          4154295625
Michael Bay          3886938960
J.J. Abrams          3579169916
dtype: int64

# 14. Какой режисер снял больше всего фильмов в стиле Action?

In [180]:
answers['14'] = '3. Robert Rodriguez'

In [181]:
# Создаем датафрейм отфильтрованый по жанрам
action_director = data[data.genres.str.contains('Action')]
#Аналогично предыдущему заданию, только используем функцию для подсчета значений
def counter(data, x):
    action_director=data[x].str.cat(sep='|')
    action_director=pd.Series(action_director.split('|'))
    action_director = action_director.value_counts(ascending=False)
    return action_director
sum_action = counter(action_director, 'director')
sum_action.head(5)

Robert Rodriguez      9
Michael Bay           7
Paul W.S. Anderson    7
Ridley Scott          6
Antoine Fuqua         6
dtype: int64

# 15. Фильмы с каким актером принесли самые высокие кассовые сборы в 2012 году?

In [182]:
answers['15'] = '3. Chris Hemsworth '

In [183]:
new_data = data[data.release_year == 2012]
new_data_1 = pd.Series(new_data['cast'].str.cat(sep='|').split('|'))\
    .value_counts(ascending=False)
  # Проходим по значениям cast в цикле
for i in new_data_1.index:
  # Присваем значение каждой из строк(это и есть сумма выручки)
    new_data_1[i] = new_data['revenue'][new_data['cast']\
 .map(lambda x: True if i in x else False)].sum()
new_data_1.sort_values(ascending=False).head(5)

Chris Hemsworth      2027450773
Denis Leary          1629460639
Anne Hathaway        1522851057
Robert Downey Jr.    1519557910
Chris Evans          1519557910
dtype: int64

# 16. Какой актер снялся в большем количестве высокобюджетных фильмов?

In [184]:
answers['16'] = '3. Matt Damon'

In [185]:
#Создаем датафрейм из высокобюджетных фильмов 
high_budget = data[data['budget'] > data['budget'].mean()]
# Превращаем актеров в список с разделением по '|'
actors_list = pd.Series(high_budget['cast'].str.cat(sep='|').split('|'))\
    .value_counts(ascending=False).head(5)
actors_list

Matt Damon           18
Adam Sandler         17
Angelina Jolie       16
Tom Cruise           15
Samuel L. Jackson    15
dtype: int64

# 17. В фильмах какого жанра больше всего снимался Nicolas Cage?

In [186]:
answers['17'] = '2. Action'

In [187]:
# Создаем датасет с фильмами где учавствовал Николас Кейдж
films = data[data.cast.str.contains('Nicolas Cage')]
# Превращаем все жанры в список с разделением по '|'
genres_list_2 = pd.Series(films['genres'].str.cat(sep='|').split('|'))\
    .value_counts(ascending=False).head(5)
#Выводим отсортированный по убыванию список
genres_list_2

Action      17
Thriller    15
Drama       12
Crime       10
Fantasy      8
dtype: int64

# 18. Самый убыточный фильм от Paramount Pictures

In [188]:
answers['18'] = '1. K-19: The Widowmaker (tt0267626)'

In [189]:
# Создаем датасет с фильмами от Paramount Pictures
studio = data[data.production_companies.str.contains('Paramount Pictures')]
# Группируем данные
studio.groupby(['imdb_id', 'original_title'])['profit']\
    .agg(['max'])\
    .sort_values(by='max', ascending=True)\
    .head(5)

                                     max
imdb_id   original_title
tt0267626 K-19: The Widowmaker -64831034
tt0300556 Timeline             -60519261
tt0435705 Next                 -51788987
tt0375173 Alfie                -46604061
tt0315297 Twisted              -24805000

# 19. Какой год стал самым успешным по суммарным кассовым сборам?

In [190]:
answers['19'] = '5. 2015'

In [191]:
# Группируем данные по году и кассовым сборам и применяем 'sum'
data.groupby(['release_year'])['revenue']\
    .agg(['sum'])\
    .sort_values(by='sum', ascending=False)\
    .head(5)

                      sum
release_year
2015          25449202382
2014          23405862953
2013          23213799791
2012          23079001687
2011          22676791872

# 20. Какой самый прибыльный год для студии Warner Bros?

In [192]:
answers['20'] = '1. 2014'

In [193]:
# Принцип тот же, значения другие
high_profit = data[data.production_companies.str.contains('Warner Bros')]
high_profit.groupby(['release_year'])['profit']\
    .agg(['sum'])\
    .sort_values(by='sum', ascending=False)\
    .head(5)

                     sum
release_year
2014          2295464519
2007          2201675217
2008          2134595031
2010          1974712985
2011          1871393682

# 21. В каком месяце за все годы суммарно вышло больше всего фильмов?

In [194]:
answers['21'] = '4. Сентябрь'

In [195]:
#Создаем колонку с отдельным месяцем
data['month'] = data['release_date'].apply(lambda x: x.split('/')[0])
month_list = pd.Series(data['month']).value_counts(ascending=False).head(5)
month_list

9     227
12    190
10    186
8     161
3     156
Name: month, dtype: int64

# 22. Сколько суммарно вышло фильмов летом? (за июнь, июль, август)

In [196]:
answers['22'] = '2. 450'

In [197]:
summer_films = \
data[(data.month == '6') | (data.month == '7') | (data.month == '8')]
len(summer_films.index)

450

# 23. Для какого режиссера зима – самое продуктивное время года?

In [198]:
answers['23'] = '5. Peter Jackson'

In [199]:
# Сортируем дф по месяцам зимы и считаем режиссеров 
winter_films = \
data[(data.month == '12') | (data.month == '1') | (data.month == '2')]
directors1 = pd.Series(winter_films['director'].str.cat(sep='|').split('|'))\
    .value_counts(ascending=False).head(5)
directors1

Peter Jackson        7
Steven Soderbergh    6
Clint Eastwood       6
Nancy Meyers         4
Martin Scorsese      4
dtype: int64

# 24. Какая студия дает самые длинные названия своим фильмам по количеству символов?

In [200]:
answers['24'] = '5. Four By Two Productions'

In [201]:
#Создаем столбец с суммой символов в названии
data['title_lenght'] = data['original_title'].apply(lambda x: len(x))
# Такой вариант был сделан,чтобы получить конкретное название студии
more_lenght = pd.Series(data['production_companies'].str.cat(sep='|').split('|'))\
    .value_counts(ascending=False)
  # Проходим по значениям отдельных студий в цикле
for i in more_lenght.index:
  # Присваем значение каждой из строк
    more_lenght[i] = data['title_lenght'][data['production_companies']\
 .map(lambda x: True if i in x else False)].mean()
more_lenght.sort_values(ascending=False).head(5)

Four By Two Productions      83
Jim Henson Company, The      59
Dos Corazones                47
Museum Canada Productions    46
Polsky Films                 46
dtype: int64

In [202]:
# В этом варианте несколько студий в ответе
data['title_lenght'] = data['original_title'].apply(lambda x: len(x))
data.groupby(['production_companies'])['title_lenght']\
    .agg(['mean'])\
    .sort_values(by='mean', ascending=False)\
    .head(5)

                                                    mean
production_companies
Twentieth Century Fox Film Corporation|Four By ...  83.0
Walt Disney|Walden Media                            62.0
Walt Disney Pictures|21 Laps Entertainment|Jim ...  59.0
Plan B Entertainment|Virtual Studios|Scott Free...  58.0
Dune Entertainment|Fox 2000 Pictures|Walden Media   56.0

# 25. Описание фильмов какой студии в среднем самые длинные по количеству слов?

In [203]:
answers['25'] = '3. Midnight Picture Show'

In [204]:
# все так же как и в прошлом задании
data['view_lenght'] = data['overview'].apply(lambda x: len(x.split()))
more_lenght2 = data[data.view_lenght > data.view_lenght.mean()]
more_lenght2.groupby(['production_companies'])['view_lenght']\
    .agg(['mean'])\
    .sort_values(by='mean', ascending=False)\
    .head(5)

                                                     mean
production_companies
Lions Gate Films|Lakeshore Entertainment|Greene...  175.0
Paramount Pictures|Metro-Goldwyn-Mayer (MGM)|Ra...  169.0
Fox Searchlight Pictures|Room 9 Entertainment       161.0
The Weinstein Company                               160.0
Columbia Pictures|Revolution Studios|Happy Madi...  159.0

In [205]:
more_lenght1 = pd.Series(data['production_companies'].str.cat(sep='|').split('|'))\
    .value_counts(ascending=False)
  # Проходим по значениям отдельных студий в цикле
for i in more_lenght1.index:
  # Присваем значение каждой из строк
    more_lenght1[i] = data['view_lenght'][data['production_companies']\
 .map(lambda x: True if i in x else False)].mean()
more_lenght1.sort_values(ascending=False).head(5)

Midnight Picture Show               175
Room 9 Entertainment                161
98 MPH Productions                  159
Heineken Branded Entertainment      159
Brookwell-McNamara Entertainment    156
dtype: int64

# 26. Какие фильмы входят в 1 процент лучших по рейтингу? 
по vote_average

In [206]:
answers['26'] = '1. Inside Out, The Dark Knight, 12 Years a Slave'

In [207]:
#Сортируем таблицу по необходимым параметрам
best_films = data[['original_title', 'vote_average']]\
                .sort_values(by = 'vote_average', ascending=False)
#Получаем список из фильмов которые входят в 1%
best_films[:round(len(best_films)*0.01)]

                                     original_title  vote_average
599                                 The Dark Knight           8.1
118                                    Interstellar           8.0
125                              The Imitation Game           8.0
9                                        Inside Out           8.0
34                                             Room           8.0
1183                        The Wolf of Wall Street           7.9
128                                       Gone Girl           7.9
1191                               12 Years a Slave           7.9
119                         Guardians of the Galaxy           7.9
1081  The Lord of the Rings: The Return of the King           7.9
1800                                        Memento           7.9
370                                       Inception           7.9
872                                     The Pianist           7.9
138                        The Grand Budapest Hotel           7.9
1188                                            Her           7.8
28                                        Spotlight           7.8
124                                      Big Hero 6           7.8
177                          The Fault in Our Stars           7.8
863           The Lord of the Rings: The Two Towers           7.8

# 27. Какие актеры чаще всего снимаются в одном фильме вместе?

In [208]:
answers['27'] = '5. Daniel Radcliffe & Rupert Grint'

In [214]:
# Создаем столбец с актерским составом без разделителя '|'
data['list_of_actors'] = data['cast'].apply(lambda x: x.split('|'))
# Создаем словарь в котором ключ - это комбинации актеров,
# а значения - это количество попаданий
all_cast = dict()
# В этом цикле проходимся по значениям нового столбца с актерами
for i in data['list_of_actors']:
# А в этом по списку из комбинаций
    for j in list(combinations(i, 2)):
        if j in all_cast:
# Проверяем есть ли в словаре такой ключ, если да то:
            all_cast[j]+=1
        else:
            all_cast[j] = 1
# Выполняем поиск по значениям в словаре и ищем максимальное
for x in all_cast:
    if all_cast[x] == max(all_cast.values()):
        print(x)

('Daniel Radcliffe', 'Rupert Grint')
('Daniel Radcliffe', 'Emma Watson')

# Submission

In [210]:
# в конце можно посмотреть свои ответы к каждому вопросу
answers

{'1': '5. Pirates of the Caribbean: On Stranger Tides (tt1298650)',
 '2': '2. Gods and Generals (tt0279111)',
 '3': '3. Winnie the Pooh (tt1449283)',
 '4': '2. 110',
 '5': '1. 107',
 '6': '5. Avatar (tt0499549)',
 '7': '5. The Lone Ranger (tt1210819)',
 '8': '1. 1478',
 '9': '4. The Dark Knight (tt0468569)',
 '10': '5. The Lone Ranger (tt1210819)',
 '11': '3. Drama',
 '12': '1. Drama',
 '13': '5. Peter Jackson',
 '14': '3. Robert Rodriguez',
 '15': '3. Chris Hemsworth ',
 '16': '3. Matt Damon',
 '17': '2. Action',
 '18': '1. K-19: The Widowmaker (tt0267626)',
 '19': '5. 2015',
 '20': '1. 2014',
 '21': '4. Сентябрь',
 '22': '2. 450',
 '23': '5. Peter Jackson',
 '24': '5. Four By Two Productions',
 '25': '3. Midnight Picture Show',
 '26': '1. Inside Out, The Dark Knight, 12 Years a Slave',
 '27': '5. Daniel Radcliffe & Rupert Grint'}

In [211]:
# и убедиться что ни чего не пропустил)
len(answers)

27